espressif/esp-idf/components/soc/esp32s2/register/soc/timer_group_reg.h
/** TIMG_LACTHI_REG register
 *  LACT high register
 */
#define TIMG_LACTHI_REG(i) (DR_REG_TIMG_BASE(i) + 0x7c)
/** TIMG_LACT_HI : RO; bitpos: [31:0]; default: 0;
 *  Reserved
 */
#define TIMG_LACT_HI    0xFFFFFFFFU
#define TIMG_LACT_HI_M  (TIMG_LACT_HI_V << TIMG_LACT_HI_S)
#define TIMG_LACT_HI_V  0xFFFFFFFFU
#define TIMG_LACT_HI_S  0

/** TIMG_LACTUPDATE_REG register
 *  LACT update register
 */
#define TIMG_LACTUPDATE_REG(i) (DR_REG_TIMG_BASE(i) + 0x80)
/** TIMG_LACT_UPDATE : WO; bitpos: [31:0]; default: 0;
 *  Reserved
 */
#define TIMG_LACT_UPDATE    0xFFFFFFFFU
#define TIMG_LACT_UPDATE_M  (TIMG_LACT_UPDATE_V << TIMG_LACT_UPDATE_S)
#define TIMG_LACT_UPDATE_V  0xFFFFFFFFU
#define TIMG_LACT_UPDATE_S  0

/** TIMG_LACTALARMLO_REG register
 *  LACT alarm low register
 */
#define TIMG_LACTALARMLO_REG(i) (DR_REG_TIMG_BASE(i) + 0x84)
/** TIMG_LACT_ALARM_LO : R/W; bitpos: [31:0]; default: 0;
 *  Reserved
 */
#define TIMG_LACT_ALARM_LO    0xFFFFFFFFU
#define TIMG_LACT_ALARM_LO_M  (TIMG_LACT_ALARM_LO_V << TIMG_LACT_ALARM_LO_S)
#define TIMG_LACT_ALARM_LO_V  0xFFFFFFFFU
#define TIMG_LACT_ALARM_LO_S  0

/** TIMG_LACTALARMHI_REG register
 *  LACT alarm high register
 */
#define TIMG_LACTALARMHI_REG(i) (DR_REG_TIMG_BASE(i) + 0x88)
/** TIMG_LACT_ALARM_HI : R/W; bitpos: [31:0]; default: 0;
 *  Reserved
 */
#define TIMG_LACT_ALARM_HI    0xFFFFFFFFU
#define TIMG_LACT_ALARM_HI_M  (TIMG_LACT_ALARM_HI_V << TIMG_LACT_ALARM_HI_S)
#define TIMG_LACT_ALARM_HI_V  0xFFFFFFFFU
#define TIMG_LACT_ALARM_HI_S  0

/** TIMG_LACTLOADLO_REG register
 *  LACT load low register
 */
#define TIMG_LACTLOADLO_REG(i) (DR_REG_TIMG_BASE(i) + 0x8c)
/** TIMG_LACT_LOAD_LO : R/W; bitpos: [31:0]; default: 0;
 *  Reserved
 */
#define TIMG_LACT_LOAD_LO    0xFFFFFFFFU
#define TIMG_LACT_LOAD_LO_M  (TIMG_LACT_LOAD_LO_V << TIMG_LACT_LOAD_LO_S)
#define TIMG_LACT_LOAD_LO_V  0xFFFFFFFFU
#define TIMG_LACT_LOAD_LO_S  0

/** TIMG_LACTLOADHI_REG register
 *  Timer LACT load high register
 */
#define TIMG_LACTLOADHI_REG(i) (DR_REG_TIMG_BASE(i) + 0x90)
/** TIMG_LACT_LOAD_HI : R/W; bitpos: [31:0]; default: 0;
 *  Reserved
 */
#define TIMG_LACT_LOAD_HI    0xFFFFFFFFU
#define TIMG_LACT_LOAD_HI_M  (TIMG_LACT_LOAD_HI_V << TIMG_LACT_LOAD_HI_S)
#define TIMG_LACT_LOAD_HI_V  0xFFFFFFFFU
#define TIMG_LACT_LOAD_HI_S  0

/** TIMG_LACTLOAD_REG register
 *  Timer LACT load register
 */
#define TIMG_LACTLOAD_REG(i) (DR_REG_TIMG_BASE(i) + 0x94)
/** TIMG_LACT_LOAD : WO; bitpos: [31:0]; default: 0;
 *  Reserved
 */
#define TIMG_LACT_LOAD    0xFFFFFFFFU
#define TIMG_LACT_LOAD_M  (TIMG_LACT_LOAD_V << TIMG_LACT_LOAD_S)
#define TIMG_LACT_LOAD_V  0xFFFFFFFFU
#define TIMG_LACT_LOAD_S  0

/** TIMG_INT_ENA_TIMERS_REG register
 *  Interrupt enable bits
 */
#define TIMG_INT_ENA_TIMERS_REG(i) (DR_REG_TIMG_BASE(i) + 0x98)
/** TIMG_T0_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The interrupt enable bit for the TIMG_T0_INT interrupt.
 */
#define TIMG_T0_INT_ENA    (BIT(0))
#define TIMG_T0_INT_ENA_M  (TIMG_T0_INT_ENA_V << TIMG_T0_INT_ENA_S)
#define TIMG_T0_INT_ENA_V  0x00000001U
#define TIMG_T0_INT_ENA_S  0
/** TIMG_T1_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The interrupt enable bit for the TIMG_T1_INT interrupt.
 */
#define TIMG_T1_INT_ENA    (BIT(1))
#define TIMG_T1_INT_ENA_M  (TIMG_T1_INT_ENA_V << TIMG_T1_INT_ENA_S)
#define TIMG_T1_INT_ENA_V  0x00000001U
#define TIMG_T1_INT_ENA_S  1
/** TIMG_WDT_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The interrupt enable bit for the TIMG_WDT_INT interrupt.
 */
#define TIMG_WDT_INT_ENA    (BIT(2))
#define TIMG_WDT_INT_ENA_M  (TIMG_WDT_INT_ENA_V << TIMG_WDT_INT_ENA_S)
#define TIMG_WDT_INT_ENA_V  0x00000001U
#define TIMG_WDT_INT_ENA_S  2
/** TIMG_LACT_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The interrupt enable bit for the TIMG_LACT_INT interrupt.
 */
#define TIMG_LACT_INT_ENA    (BIT(3))
#define TIMG_LACT_INT_ENA_M  (TIMG_LACT_INT_ENA_V << TIMG_LACT_INT_ENA_S)
#define TIMG_LACT_INT_ENA_V  0x00000001U
#define TIMG_LACT_INT_ENA_S  3

/** TIMG_INT_RAW_TIMERS_REG register
 *  Raw interrupt status
 */
#define TIMG_INT_RAW_TIMERS_REG(i) (DR_REG_TIMG_BASE(i) + 0x9c)
/** TIMG_T0_INT_RAW : RO; bitpos: [0]; default: 0;
 *  The raw interrupt status bit for the TIMG_T0_INT interrupt.
 */
#define TIMG_T0_INT_RAW    (BIT(0))
#define TIMG_T0_INT_RAW_M  (TIMG_T0_INT_RAW_V << TIMG_T0_INT_RAW_S)
#define TIMG_T0_INT_RAW_V  0x00000001U
#define TIMG_T0_INT_RAW_S  0
/** TIMG_T1_INT_RAW : RO; bitpos: [1]; default: 0;
 *  The raw interrupt status bit for the TIMG_T1_INT interrupt.
 */
#define TIMG_T1_INT_RAW    (BIT(1))
#define TIMG_T1_INT_RAW_M  (TIMG_T1_INT_RAW_V << TIMG_T1_INT_RAW_S)
#define TIMG_T1_INT_RAW_V  0x00000001U
#define TIMG_T1_INT_RAW_S  1
/** TIMG_WDT_INT_RAW : RO; bitpos: [2]; default: 0;
 *  The raw interrupt status bit for the TIMG_WDT_INT interrupt.
 */
#define TIMG_WDT_INT_RAW    (BIT(2))
#define TIMG_WDT_INT_RAW_M  (TIMG_WDT_INT_RAW_V << TIMG_WDT_INT_RAW_S)
#define TIMG_WDT_INT_RAW_V  0x00000001U
#define TIMG_WDT_INT_RAW_S  2
/** TIMG_LACT_INT_RAW : RO; bitpos: [3]; default: 0;
 *  The raw interrupt status bit for the TIMG_LACT_INT interrupt.
 */
#define TIMG_LACT_INT_RAW    (BIT(3))
#define TIMG_LACT_INT_RAW_M  (TIMG_LACT_INT_RAW_V << TIMG_LACT_INT_RAW_S)
#define TIMG_LACT_INT_RAW_V  0x00000001U
#define TIMG_LACT_INT_RAW_S  3

/** TIMG_INT_ST_TIMERS_REG register
 *  Masked interrupt status
 */
#define TIMG_INT_ST_TIMERS_REG(i) (DR_REG_TIMG_BASE(i) + 0xa0)
/** TIMG_T0_INT_ST : RO; bitpos: [0]; default: 0;
 *  The masked interrupt status bit for the TIMG_T0_INT interrupt.
 */
#define TIMG_T0_INT_ST    (BIT(0))
#define TIMG_T0_INT_ST_M  (TIMG_T0_INT_ST_V << TIMG_T0_INT_ST_S)
#define TIMG_T0_INT_ST_V  0x00000001U
#define TIMG_T0_INT_ST_S  0
/** TIMG_T1_INT_ST : RO; bitpos: [1]; default: 0;
 *  The masked interrupt status bit for the TIMG_T1_INT interrupt.
 */
#define TIMG_T1_INT_ST    (BIT(1))
#define TIMG_T1_INT_ST_M  (TIMG_T1_INT_ST_V << TIMG_T1_INT_ST_S)
#define TIMG_T1_INT_ST_V  0x00000001U
#define TIMG_T1_INT_ST_S  1
/** TIMG_WDT_INT_ST : RO; bitpos: [2]; default: 0;
 *  The masked interrupt status bit for the TIMG_WDT_INT interrupt.
 */
#define TIMG_WDT_INT_ST    (BIT(2))
#define TIMG_WDT_INT_ST_M  (TIMG_WDT_INT_ST_V << TIMG_WDT_INT_ST_S)
#define TIMG_WDT_INT_ST_V  0x00000001U
#define TIMG_WDT_INT_ST_S  2
/** TIMG_LACT_INT_ST : RO; bitpos: [3]; default: 0;
 *  The masked interrupt status bit for the TIMG_LACT_INT interrupt.
 */
#define TIMG_LACT_INT_ST    (BIT(3))
#define TIMG_LACT_INT_ST_M  (TIMG_LACT_INT_ST_V << TIMG_LACT_INT_ST_S)
#define TIMG_LACT_INT_ST_V  0x00000001U
#define TIMG_LACT_INT_ST_S  3

